#ifndef __LS2K_ETH_DEV_H__
#define __LS2K_ETH_DEV_H__

#include <stdint.h>
#include <stdbool.h>

// mac can support up to 32 phys
#define GMAC_PHY_BASE        0
#define DEFAULT_PHY_BASE     0

// macbase and dmabase address
#define MACBASE     0x0000
#define DMABASE     0x1000

#define TX_DESC_NUM     128           // Tx Descriptors needed in the Descriptor queue
#define RX_DESC_NUM     128           // Rx Descriptors needed in the Descriptor queue

// 802.3 ethernet frame structure
// the default ethernet frame is 1,518/1,522 bytes
// 9,018/9,022 bytes if jumbo frame enable is set
#define ETHERNET_HEADER          14           // 6 byte Dest addr, 6 byte Src addr, 2 byte ethertype or length
#define ETHERNET_CRC             4            // Ethernet CRC
#define VLAN_TAG                 4            // optional 802.1q VLAN Tag
#define VLAN_TAG_QINQ            4            // optional 802.1ad VLAN Tag (QinQ)
#define MIN_ETHERNET_PAYLOAD     46           // Minimum Ethernet payload size (42 when 802.1q VLAN Tag present)
#define MAX_ETHERNET_PAYLOAD     1500         // Maximum Ethernet payload size
#define JUMBO_FRAME_PAYLOAD      9000         // Jumbo frame payload size

// RX Buffer size must be multiple of 4/8/16 bytes
#define BUF_SIZE_16KiB     16368
#define BUF_SIZE_8KiB      8188
#define BUF_SIZE_4KiB      4096
#define BUF_SIZE_2KiB      2048

// #define TX_BUF_SIZE     ETHERNET_HEADER + VLAN_TAG + MAX_ETHERNET_PAYLOAD + ETHERNET_CRC
// #define RX_BUF_SIZE     ETHERNET_HEADER + VLAN_TAG + MAX_ETHERNET_PAYLOAD + ETHERNET_CRC

// for alignment
#define TX_BUF_SIZE     BUF_SIZE_2KiB
#define RX_BUF_SIZE     BUF_SIZE_2KiB



// !!! NEVER TOUCH IT !!!
// for enhanced desc (4 dwords)
typedef struct DmaDescStruct
{
    uint32_t status;
    uint32_t length;  // buffer (1/2) length
    uint32_t buffer1; // buffer 1 pointer (dmaable)
    uint32_t buffer2; // buffer 2 pointer in ring or next descriptor pointer in chain (dmaable)
} DmaDesc;

// for enhanced desc (8 dwords)
// uint32_t status;
// uint32_t length;
// uint32_t buffer1;
// uint32_t buffer2;
// uint32_t extstatus;
// uint32_t reserved;
// uint32_t timestamplow;
// uint32_t timestamphigh;

struct DmaFeature {
    uint32_t mbps_10_100 : 1;        //  0
    uint32_t mbps_1000 : 1;          //  1
    uint32_t half_duplex : 1;        //  2
    uint32_t hash_filter : 1;         //  4
    uint32_t multi_addr : 1;         //  5
    uint32_t pcs : 1;                //  6
    uint32_t sma_mdio : 1;           //  8
    uint32_t pmt_remote_wake_up : 1; //  9
    uint32_t pmt_magic_frame : 1;    // 10
    uint32_t rmon : 1;               // 11
    uint32_t time_stamp : 1;         // 12
    uint32_t atime_stamp : 1;        // 13
    uint32_t eee : 1;                // 14
    uint32_t av : 1;                 // 15
    uint32_t tx_coe : 1;             // 16
    uint32_t rx_coe : 1;             // 17/18
    uint32_t rx_coe_type1 : 1;       // 17
    uint32_t rx_coe_type2 : 1;       // 18
    uint32_t rxfifo_over_2048 : 1;    // 19
    uint32_t number_rx_channel : 2;  // 20-21
    uint32_t number_tx_channel : 2;  // 22-23
    uint32_t enh_desc : 1;           // 24
};

struct net_device
{
    void *parent;                 // point to OS defined net struct

    uint64_t iobase;              // base address of MAC
    uint8_t MacAddr[6];           // mac address

    uint64_t MacBase;             // base address of GMAC
    uint64_t DmaBase;             // base address of DMA
    uint64_t PhyBase;             // phy device addr, 0 by default
    uint32_t Version;             // MAC version
    // struct DmaFeature DmaCap;     // DMA hardware feature

    uint32_t TxBusy;              // index of the first tx desc owned by DMA
    uint32_t TxNext;              // index of the first tx desc available
    uint32_t RxBusy;              // index of the first rx desc owned by DMA

    DmaDesc *TxDesc[TX_DESC_NUM]; // tx desc ptr queue
    DmaDesc *RxDesc[RX_DESC_NUM]; // rx desc ptr queue
    void *TxBuffer[TX_DESC_NUM];  // tx buffer ptr queue
    void *RxBuffer[RX_DESC_NUM];  // rx buffer ptr queue

